# Series

In [171]:
# len(data) should be equal to len(index)

In [172]:
import numpy as np

In [173]:
import pandas as pd

In [174]:
labels = ['a','b','c']

In [175]:
my_data = [10,20,30]

In [176]:
arr = np.array(my_data)

In [177]:
arr

array([10, 20, 30])

In [178]:
d = {'a':10,'b':20,'c':30}

In [179]:
d

{'a': 10, 'b': 20, 'c': 30}

In [180]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [181]:
pd.Series(data = labels)

0    a
1    b
2    c
dtype: object

In [182]:
pd.Series(data = d)

a    10
b    20
c    30
dtype: int64

In [183]:
pd.Series(my_data,labels)

a    10
b    20
c    30
dtype: int64

In [184]:
pd.Series(data=labels,index=my_data)

10    a
20    b
30    c
dtype: object

In [185]:
pd.Series(data=my_data,index=labels)

a    10
b    20
c    30
dtype: int64

In [186]:
pd.Series(my_data,index=labels)

a    10
b    20
c    30
dtype: int64

In [187]:
pd.Series(my_data,my_data)

10    10
20    20
30    30
dtype: int64

In [188]:
pd.Series(d,labels) - pd.Series(d)*2

a   -10
b   -20
c   -30
dtype: int64

In [189]:
arr1 = np.arange(0,2)

In [190]:
pd.Series(arr1)

0    0
1    1
dtype: int32

In [191]:
my_list1 = [1,2,3,4]
arr2 = np.array(my_list1)

In [192]:
arr2

array([1, 2, 3, 4])

In [193]:
pd.Series(arr2)

0    1
1    2
2    3
3    4
dtype: int32

In [194]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [195]:
pd.Series(data=[sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [196]:
ser1 = pd.Series([1,2,3,4],['Mercedes','RBR','Renault','Ferrari'])

In [197]:
ser1

Mercedes    1
RBR         2
Renault     3
Ferrari     4
dtype: int64

In [198]:
ser2 = pd.Series([1,2,5,4],['Mercedes','RBR','Racing Point','Ferrari'])

In [199]:
ser2

Mercedes        1
RBR             2
Racing Point    5
Ferrari         4
dtype: int64

In [200]:
ser1['Mercedes']

1

In [201]:
num1 = ser1[ser1[ser2[ser1['Mercedes']]]]-1

In [202]:
ser2[num1]

4

In [203]:
ser1 + ser2

Ferrari         8.0
Mercedes        2.0
RBR             4.0
Racing Point    NaN
Renault         NaN
dtype: float64

# DataFrames

In [204]:
import numpy as np
import pandas as pd

In [205]:
from numpy.random import randn

In [206]:
np.random.seed(101)

In [207]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [208]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

# Columns

In [209]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [210]:
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [211]:
type(df['W'])

pandas.core.series.Series

In [212]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [213]:
#df['new']

In [214]:
df['new'] = df['W'] + df['Z']

In [215]:
df['new']

A    3.210676
B    1.257083
C   -2.607169
D    1.143752
E    0.874303
Name: new, dtype: float64

In [216]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [217]:
df.drop('new',axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [218]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [219]:
df.drop('new',axis=1,inplace=True)

In [220]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [221]:
df.drop('E')

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [222]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [223]:
df.drop('E',axis=0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [224]:
df.drop('E',axis=0,inplace=True)

In [225]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [226]:
# Selecting Rows

In [227]:
df.shape

(4, 4)

In [228]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [229]:
df.loc[['A','B']][['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965

In [230]:
df.iloc[1]

W    0.651118
X   -0.319318
Y   -0.848077
Z    0.605965
Name: B, dtype: float64

In [231]:
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [232]:
df.iloc[1] + df.iloc[2]

W   -1.367050
X    0.420804
Y   -0.319263
Z    0.016965
dtype: float64

In [233]:
df.iloc[1,2]

-0.8480769834036315

In [234]:
df.loc['B','Y']

-0.8480769834036315

In [235]:
df.loc[['A','B'],['W','X']]

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318

In [236]:
df.loc[['A','B']][['W','X']]

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318

In [237]:
type(df.loc[['A','B'],['W','X']])

pandas.core.frame.DataFrame

In [238]:
type(df.loc[['A','B']][['W','X']])

pandas.core.frame.DataFrame

# DataFrames Part II

In [239]:
import numpy as np
import pandas as pd

In [240]:
from numpy.random import randn

In [241]:
np.random.seed(101)

In [242]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [243]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [244]:
df > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [245]:
df < 0

       W      X      Y      Z
A  False  False  False  False
B  False   True   True  False
C   True  False  False   True
D  False   True   True  False
E  False  False  False  False

In [246]:
df == 0

       W      X      Y      Z
A  False  False  False  False
B  False  False  False  False
C  False  False  False  False
D  False  False  False  False
E  False  False  False  False

In [247]:
booldf_gt = df > 0

In [248]:
df[booldf_gt]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [249]:
booldf_lt = df <  0

In [250]:
df[booldf_lt]

          W         X         Y         Z
A       NaN       NaN       NaN       NaN
B       NaN -0.319318 -0.848077       NaN
C -2.018168       NaN       NaN -0.589001
D       NaN -0.758872 -0.933237       NaN
E       NaN       NaN       NaN       NaN

In [251]:
booldf_gt & booldf_lt

       W      X      Y      Z
A  False  False  False  False
B  False  False  False  False
C  False  False  False  False
D  False  False  False  False
E  False  False  False  False

In [252]:
booldf_gt | booldf_lt

      W     X     Y     Z
A  True  True  True  True
B  True  True  True  True
C  True  True  True  True
D  True  True  True  True
E  True  True  True  True

In [253]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [254]:
df[df['Z']<0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [255]:
result_df = df[df['Z']<0]

In [256]:
result_df

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [257]:
result_df['W']

C   -2.018168
Name: W, dtype: float64

In [258]:
df[df['Z']<0]['W']

C   -2.018168
Name: W, dtype: float64

In [259]:
df[df['Z']<0][['W','X']]

          W         X
C -2.018168  0.740122

In [260]:
df[(df['W']>0) & (df['X']>0)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
E  0.190794  1.978757  2.605967  0.683509

In [261]:
df[(df['W']>0) | (df['X']>1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [262]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [263]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [264]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [265]:
df.reset_index(inplace=True)

In [266]:
df

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [267]:
# index reset removed

In [268]:
df

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [269]:
new_indx = 'NY CA TX NC FL'.split()

In [270]:
new_indx

['NY', 'CA', 'TX', 'NC', 'FL']

In [271]:
df['States'] = new_indx

In [272]:
df['States']

0    NY
1    CA
2    TX
3    NC
4    FL
Name: States, dtype: object

In [273]:
# new column added to DataFrame - 'States'

In [274]:
df

  index         W         X         Y         Z States
0     A  2.706850  0.628133  0.907969  0.503826     NY
1     B  0.651118 -0.319318 -0.848077  0.605965     CA
2     C -2.018168  0.740122  0.528813 -0.589001     TX
3     D  0.188695 -0.758872 -0.933237  0.955057     NC
4     E  0.190794  1.978757  2.605967  0.683509     FL

In [275]:
df.set_index('States')

       index         W         X         Y         Z
States
NY         A  2.706850  0.628133  0.907969  0.503826
CA         B  0.651118 -0.319318 -0.848077  0.605965
TX         C -2.018168  0.740122  0.528813 -0.589001
NC         D  0.188695 -0.758872 -0.933237  0.955057
FL         E  0.190794  1.978757  2.605967  0.683509

# DataFrames  Part III

In [276]:
import numpy as np
import pandas as pd

In [277]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]

In [278]:
mod_index = list(zip(outside,inside))

In [279]:
mod_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [280]:
mod_index = pd.MultiIndex.from_tuples(mod_index)

In [281]:
mod_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [282]:
type(mod_index)

pandas.core.indexes.multi.MultiIndex

In [283]:
df = pd.DataFrame(randn(6,2),mod_index,['A','B'])

In [284]:
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [285]:
df.loc['G1']

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [286]:
df.loc['G2']

          A         B
1  0.166905  0.184502
2  0.807706  0.072960
3  0.638787  0.329646

In [287]:
df.iloc[0]

A    0.302665
B    1.693723
Name: (G1, 1), dtype: float64

In [288]:
df.iloc[1]

A   -1.706086
B   -1.159119
Name: (G1, 2), dtype: float64

In [289]:
df.loc['G1'].loc[1]

A    0.302665
B    1.693723
Name: 1, dtype: float64

In [290]:
df.loc['G1'].iloc[1]

A   -1.706086
B   -1.159119
Name: 2, dtype: float64

In [291]:
df.loc['G1'].iloc[0]

A    0.302665
B    1.693723
Name: 1, dtype: float64

In [292]:
df.index.names

FrozenList([None, None])

In [293]:
df.index.names = ['Groups', 'Num']

In [294]:
df

                   A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [295]:
df.loc['G2'].loc[2,'B']

0.07295967531703869

In [296]:
df.loc['G2'].loc[2]['B']

0.07295967531703869

In [297]:
df.loc['G1'].loc[3]['B']

0.39052784273374097

In [298]:
df.xs('G1')

            A         B
Num
1    0.302665  1.693723
2   -1.706086 -1.159119
3   -0.134841  0.390528

In [299]:
df.xs('G2')

            A         B
Num
1    0.166905  0.184502
2    0.807706  0.072960
3    0.638787  0.329646

In [300]:
df.xs(1,level='Num')

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502

In [301]:
df.xs(2,level='Num')

               A         B
Groups
G1     -1.706086 -1.159119
G2      0.807706  0.072960

In [302]:
df.xs(3,level='Num')

               A         B
Groups
G1     -0.134841  0.390528
G2      0.638787  0.329646

# Missing Data

In [303]:
import numpy as np
import pandas as pd

In [304]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[6,7,8]}

In [305]:
type(d)

dict

In [306]:
df = pd.DataFrame(d)

In [307]:
df

     A    B  C
0  1.0  5.0  6
1  2.0  NaN  7
2  NaN  NaN  8

In [308]:
df.dropna()

     A    B  C
0  1.0  5.0  6

In [309]:
df.dropna(axis=1)

   C
0  6
1  7
2  8

In [310]:
# default axis = 0 (rows)
df.dropna(axis=0)

     A    B  C
0  1.0  5.0  6

In [311]:
df

     A    B  C
0  1.0  5.0  6
1  2.0  NaN  7
2  NaN  NaN  8

In [312]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  6
1  2.0  NaN  7

In [313]:
df.fillna(value='NA')

    A   B  C
0   1   5  6
1   2  NA  7
2  NA  NA  8

In [314]:
df['A']

0    1.0
1    2.0
2    NaN
Name: A, dtype: float64

In [315]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [316]:
df['B']

0    5.0
1    NaN
2    NaN
Name: B, dtype: float64

In [317]:
df['B'].fillna(value=df['B'].mean())

0    5.0
1    5.0
2    5.0
Name: B, dtype: float64

In [318]:
df['C']

0    6
1    7
2    8
Name: C, dtype: int64

# Groupby

In [319]:
import numpy as np
import pandas as pd

In [320]:
sales_data = {'Team':['Mercedes AMG Petronas','Mercedes AMG Petronas','Scuderia Ferrari','Scuderia Ferrari',
                      'Red Bull Racing','Red Bull Racing'],
             'Driver':['Lewis Hamilton','Valtteri Bottas','Sebastian Vettel','Charles Leclerc',
                       'Max Verstappen','Alex Albon'],
             'Revenue':[900,800,900,800,900,800]}

In [321]:
sales_df = pd.DataFrame(sales_data)

In [322]:
sales_df

                    Team            Driver  Revenue
0  Mercedes AMG Petronas    Lewis Hamilton      900
1  Mercedes AMG Petronas   Valtteri Bottas      800
2       Scuderia Ferrari  Sebastian Vettel      900
3       Scuderia Ferrari   Charles Leclerc      800
4        Red Bull Racing    Max Verstappen      900
5        Red Bull Racing        Alex Albon      800

In [323]:
f1_team = sales_df.groupby('Team')

In [324]:
f1_team.mean()

                       Revenue
Team
Mercedes AMG Petronas      850
Red Bull Racing            850
Scuderia Ferrari           850

In [325]:
f1_team.sum()

                       Revenue
Team
Mercedes AMG Petronas     1700
Red Bull Racing           1700
Scuderia Ferrari          1700

In [326]:
f1_team.std()

                         Revenue
Team
Mercedes AMG Petronas  70.710678
Red Bull Racing        70.710678
Scuderia Ferrari       70.710678

In [327]:
f1_team.sum().loc['Red Bull Racing']

Revenue    1700
Name: Red Bull Racing, dtype: int64

In [328]:
sales_df.groupby('Team').sum().loc['Red Bull Racing']

Revenue    1700
Name: Red Bull Racing, dtype: int64

In [329]:
sales_df.groupby('Team').describe()

                      Revenue                                                \
                        count   mean        std    min    25%    50%    75%
Team
Mercedes AMG Petronas     2.0  850.0  70.710678  800.0  825.0  850.0  875.0
Red Bull Racing           2.0  850.0  70.710678  800.0  825.0  850.0  875.0
Scuderia Ferrari          2.0  850.0  70.710678  800.0  825.0  850.0  875.0


                         max
Team
Mercedes AMG Petronas  900.0
Red Bull Racing        900.0
Scuderia Ferrari       900.0

In [330]:
sales_df.groupby('Team').describe().transpose()

Team           Mercedes AMG Petronas  Red Bull Racing  Scuderia Ferrari
Revenue count               2.000000         2.000000          2.000000
        mean              850.000000       850.000000        850.000000
        std                70.710678        70.710678         70.710678
        min               800.000000       800.000000        800.000000
        25%               825.000000       825.000000        825.000000
        50%               850.000000       850.000000        850.000000
        75%               875.000000       875.000000        875.000000
        max               900.000000       900.000000        900.000000

In [331]:
sales_df.groupby('Team').describe().transpose()['Mercedes AMG Petronas']

Revenue  count      2.000000
         mean     850.000000
         std       70.710678
         min      800.000000
         25%      825.000000
         50%      850.000000
         75%      875.000000
         max      900.000000
Name: Mercedes AMG Petronas, dtype: float64

In [332]:
import numpy as np
import pandas as pd

In [333]:
df1 = pd.DataFrame({'A':['A0','A1','A2','A3'],'B':['B0','B1','B2','B3'],'C':['C0','C1','C2','C3'],
                   'D':['D0','D1','D2','D3']}, index=[0,1,2,3])

In [334]:
df2 = pd.DataFrame({'A':['A4','A5','A6','A7'],'B':['B4','B5','B6','B7'],'C':['C4','C5','C6','C7'],
                   'D':['D4','D5','D6','D7']}, index=[4,5,6,7])

In [335]:
df3 = pd.DataFrame({'A':['A8','A9','A10','A11'],'B':['B8','B9','B10','B11'],'C':['C8','C9','C10','C11'],
                   'D':['D8','D9','D10','D11']}, index=[8,9,10,11])

In [336]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [337]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [338]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

# Concatenation

In [339]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [340]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

# Example DataFrames

In [343]:
import pandas as pd

In [359]:
left_df = pd.DataFrame( {'key':['K0','K1','K2','K3'],'A':['A0','A1','A2','A3'],'B':['B0','B1','B2','B3']} )

In [360]:
right_df = pd.DataFrame( {'key':['K0','K1','K2','K3'],'C':['C0','C1','C2','C3'],'D':['D0','D1','D2','D3']} )

In [361]:
left_df

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [362]:
right_df

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

# Merge

In [370]:
pd.merge(left_df,right_df,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [372]:
left_df1 = pd.DataFrame( {'key1':['K0','K0','K1','K2'],'key2':['K0','K1','K0','K1'],
                         'A':['A0','A1','A2','A3'],'B':['B0','B1','B2','B3']} )

In [373]:
right_df1 = pd.DataFrame( {'key1':['K0','K1','K1','K2'],'key2':['K0','K0','K0','K0'],
                           'C':['C0','C1','C2','C3'],'D':['D0','D1','D2','D3']} )

In [374]:
pd.merge(left_df1,right_df1,on=['key1','key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [375]:
pd.merge(left_df1,right_df1,how='outer',on=['key1','key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [376]:
pd.merge(left_df1,right_df1,how='inner',on=['key1','key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [377]:
pd.merge(left_df1,right_df1,how='right',on=['key1','key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [378]:
pd.merge(left_df1,right_df1,how='left',on=['key1','key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

# Joining

In [386]:
left_df2 = pd.DataFrame({'A':['A0','A1','A2'],'B':['B0','B1','B2']}, index=['K0','K1','K2'])

In [387]:
right_df2 = pd.DataFrame({'C':['C0','C1','C2'],'D':['D0','D1','D2']}, index=['K0','K2','K3'])

In [388]:
left_df2.join(right_df2)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C1   D1

In [389]:
right_df2.join(left_df2)

     C   D    A    B
K0  C0  D0   A0   B0
K2  C1  D1   A2   B2
K3  C2  D2  NaN  NaN

In [390]:
left_df2.join(right_df2,how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C1   D1
K3  NaN  NaN   C2   D2

In [391]:
left_df2.join(right_df2,how='inner')

     A   B   C   D
K0  A0  B0  C0  D0
K2  A2  B2  C1  D1

In [392]:
left_df2.join(right_df2,how='left')

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C1   D1

In [393]:
left_df2.join(right_df2,how='right')

      A    B   C   D
K0   A0   B0  C0  D0
K2   A2   B2  C1  D1
K3  NaN  NaN  C2  D2